# Урок № 2, задача № 1:
# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = ['строка', 1, 2.2, True, None]
print(my_list, '\n', type(my_list[0]), type(my_list[1]), type(my_list[2]), type(my_list[3]), type(my_list[4]))
