# Урок № 5, задача № 6:
# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
# Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

my_dict = {}
with open('lesson05_task06.txt', 'r', encoding='utf-8') as f:
    for line in f:
        name, tasks = line.split(':')
        num = [i for i in tasks if i == ' ' or (i >= '0' and i <= '9')]
        tasks_sum = sum(map(int, ''.join(num).split()))
        my_dict[name] = tasks_sum
print(my_dict)
